InformationRegisters/бит_си_НастройкиИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_си_НастройкиИсточников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_си_Источники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/бит_си_ПолныеПрава/Ext/Module.bsl
#Область ПроцедурыИФункцииУправленияПравамиДоступа

// Проверяет доступность роли для текущего пользователя.
// Если пользователи ИБ отсутствуют, то роль всегда считается доступной.
// 
// Параметры: 
// 	ИмяРоли         	 -	Строка, ОбъектМетадан	 Роль или имя роли для проверки.
// 	                   	  	             	                                                                  
// Возвращаемое значение:
// 	Возврат ...        	 -	Булево                	 Истина - Роль доступна, Ложь - не доступна.
// 	                   	  	СправочникСсылка.       	                                                                  
//
Функция бит_си_РольДоступна(ИмяРоли) Экспорт
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	Попытка
		//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
		Возврат РольДоступна(ИмяРоли);
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции // бит_си_РольДоступна()

#КонецОбласти

#Область ПроцедурыИФункцииНастройкиИсточниковСправочнойИнформации

// Возвращает список способов определения текущего объекта настройки источников справочной информации.
// 
// Возвращаемое значение:
// 	Возврат ...        	 -	ТаблицаЗначений        	 Таблица доступных способов определения объекта настройки.
//		Поля:
//		  Имя			 - Строка					 Имя способа получения объекта настройки.
//		  Представление  - Строка					 Пользовательское представление способа получения объекта настройки.
//		  Код			 - Строка					 Алгоритм получения объекта настройки.
//
Функция ПолучитьСписокНастроекПолученияОбъектаНастройки() Экспорт
	СписокНастроек = Новый ТаблицаЗначений();
	СписокНастроек.Колонки.Добавить("Имя",Новый ОписаниеТипов("Строка"));
	СписокНастроек.Колонки.Добавить("Представление",Новый ОписаниеТипов("Строка"));
	СписокНастроек.Колонки.Добавить("Код",Новый ОписаниеТипов("Строка"));
	
	Настройка = СписокНастроек.Добавить();
	Настройка.Имя = "БухгалтерияПредприятия";
	Настройка.Представление = "Бухгалтерия предприятия";
	Настройка.Код = "Результат = ПараметрыСеанса.ТекущийПользователь;";
	
	Настройка = СписокНастроек.Добавить();
	Настройка.Имя = "УправлениеТорговлей";
	Настройка.Представление = "Управление торговлей";
	Настройка.Код = "Результат = ПараметрыСеанса.ТекущийПользователь;";
	
	Настройка = СписокНастроек.Добавить();
	Настройка.Имя = "ЗарплатаИУправлениеПерсоналом";
	Настройка.Представление = "Зарплата и Управление Персоналом";
	Настройка.Код = "Результат = ПараметрыСеанса.ТекущийПользователь;";
	
	Настройка = СписокНастроек.Добавить();
	Настройка.Имя = "УправлениеПроизводственнымПредприятием";
	Настройка.Представление = "Управление производственным предприятием";
	Настройка.Код = "Результат = ПараметрыСеанса.ТекущийПользователь;";
	
	Настройка = СписокНастроек.Добавить();
	Настройка.Имя = "УправлениеСтроительнойОрганизацией";
	Настройка.Представление = "1С:Управление строительной организацией";
	Настройка.Код = "Результат = ПараметрыСеанса.ТекущийПользователь;";
	
	Настройка = СписокНастроек.Добавить();
	Настройка.Имя = "УправляющийСтандарт";
	Настройка.Представление = "1С:Управляющий 8 Стандарт";
	Настройка.Код = "Результат = ПараметрыСеанса.ТекущийПользователь;";
	
	Настройка = СписокНастроек.Добавить();
	Настройка.Имя = "ПользовательИБИмя";
	Настройка.Представление = "По имени пользователя ИБ";
	Настройка.Код = "Результат = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;";
	
	Настройка = СписокНастроек.Добавить();
	Настройка.Имя = "ПользовательИБИд";
	Настройка.Представление = "По уникальному идентификатору пользователя ИБ";
	Настройка.Код = "Результат = СокрЛП(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);";
	
	Возврат СписокНастроек;
КонецФункции // ПолучитьСписокНастроекПолученияОбъектаНастройки()

// Получает текущего пользователя по настройкам источника.
// 
// Параметры: 
// 	ИсточникСИ         	 -	СправочникСсылка.бит_си	 Источник справочной информации.                                   
// 	                   	  	             	                                                                  
// Возвращаемое значение:
// 	Возврат ...        	 -	Строка,                	 Текущий пользователь.                                             
// 	                   	  	СправочникСсылка.       	                                                                  
//
Функция ПолучитьТекущийОбъектНастройки(ИсточникСИ) Экспорт
	Если ТипЗнч(ИсточникСИ) = Тип("Строка") Тогда
		Код = ИсточникСИ;
	ИначеЕсли ТипЗнч(ИсточникСИ) = Тип("СправочникСсылка.бит_си_Источники") Тогда
		Попытка
			Код = СокрЛП(ИсточникСИ.ПолучениеТекущегоОбъектаНастройки.Получить().Код);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Результат = Неопределено;
	Попытка
		Выполнить(Код);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат Результат;
КонецФункции // ПолучитьТекущийОбъектНастройки()

// Получает таблицу настроек для переданного списка пользователей.
// 
// Параметры: 
// 	ИсточникСИ         	 -	СправочникСсылка.бит_си	 Источник справочной информации.                                   
// 	                   	  	_Источники.             	                                                                  
// 	ПарамОбъекты       	 -	Массив,                	 Список пользователей. Если "Неопределено". то возвращает все.     
// 	                   	  	СправочникСсылка,      	 настройки.                                                       
// 	                   	  	Строка, Неопределено.   	                                                                  
// Возвращаемое значение:
// 	Возврат ...        	 -	ТаблицаЗначений        	 Таблица пользователей и настроек.                                 
//		Колонки:
//			Объект		-	Строка, СправочникСсылка Пользователь.
//			Настройка	-	ХранилищеЗначения		 Настройка пользователя.
//
Функция ПолучитьНастройкиИсточника(ИсточникСИ, ПарамОбъекты = Неопределено) Экспорт
	МассивОбъектов = Новый Массив();
	Если НЕ ТипЗнч(ПарамОбъекты) = Тип("Массив") Тогда
		МассивОбъектов.Добавить(ПарамОбъекты);
	Иначе
		МассивОбъектов = ПарамОбъекты;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиИсточников.Объект,
	                      |	НастройкиИсточников.Настройка
	                      |ИЗ
	                      |	РегистрСведений.бит_си_НастройкиИсточников КАК НастройкиИсточников
	                      |ГДЕ
	                      |	НастройкиИсточников.Источник = &Источник
	                      |	И (НастройкиИсточников.Объект В (&МассивОбъектов)
	                      |			ИЛИ &ВсеОбъекты)");
	
	Запрос.УстановитьПараметр("Источник", ИсточникСИ);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВсеОбъекты", ПарамОбъекты = Неопределено);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьНастройкиИсточника()

// Получает настройки источника справочной информации для переданного пользователя.
// Или настройки по умолчанию, если настроек для пользователя не найдено.
// 
// Параметры: 
// 	ИсточникСИ         	 -	СправочникСсылка.бит_си	 Источник справочной информации.                                   
// 	                   	  	_Источники.             	                                                                  
// 	ПарамОбъект        	 -	Строка,                	 Пользователь для которого получаем настройку.                     
// 	                   	  	СправочникСсылка       	                                                                  
// 	Хранилище          	 -	Булево                 	 Истина - Получает в виде хранилища значений; Ложь - в виде.       
// 	                   	  	                       	 Структуры; По умолчанию - Ложь.                                   
// Возвращаемое значение:
// 	Возврат ...        	 -	ХранилищеЗначения,     	 Найденные настройки, если не найдены. то настройки по умолчанию.  
// 	                   	  	Структура.             	                                                                  
//
Функция ПолучитьНастройкуИсточника(ИсточникСИ, ПарамОбъект = Неопределено, Хранилище = Ложь) Экспорт
	Если ПарамОбъект = Неопределено Тогда
		Возврат ?(Хранилище, ИсточникСИ.НастройкаПоУмолчанию, ИсточникСИ.НастройкаПоУмолчанию.Получить());
	КонецЕсли;
	ТабНастройки = бит_си_ПолныеПрава.ПолучитьНастройкиИсточника(ИсточникСИ, ПарамОбъект);
	Если ТабНастройки.Количество() = 0 Тогда
		Возврат ?(Хранилище, ИсточникСИ.НастройкаПоУмолчанию, ИсточникСИ.НастройкаПоУмолчанию.Получить());
	Иначе
		Возврат ?(Хранилище, ТабНастройки[0].Настройка, ТабНастройки[0].Настройка.Получить());
	КонецЕсли;
КонецФункции // ПолучитьНастройкуИсточника()

// Получает настройки источника справочной информации для текущего пользователя.
// 
// Параметры: 
// 	ИсточникСИ         	 -	СправочникСсылка.бит_си	 Источник справочной информации.                                   
// 	                   	  	_Источники.             	                                                                  
// 	Хранилище          	 -	Булево                 	 Истина - возвращает настройки в виде хранилища значения; Ложь - в.
// 	                   	  	                       	 Виде структуры; по умолчанию - Ложь.                              
// Возвращаемое значение:
// 	Возврат ...        	 -	ХранилищеЗначения,     	 Настройки текущего пользователя.                                  
// 	                   	  	Структура.              	                                                                  
//
Функция ПолучитьТекущуюНастройкуИсточника(ИсточникСИ, Хранилище = Ложь) Экспорт
	Возврат ПолучитьНастройкуИсточника(ИсточникСИ,
									   бит_си_ПолныеПрава.ПолучитьТекущийОбъектНастройки(ИсточникСИ),
									   Хранилище);
КонецФункции // ПолучитьТекущуюНастройкуИсточника()

#КонецОбласти

#Область ПроцедурыИФункцииОбновленияМодуля

// Функция получает список общих настроек.
// 
// Параметры: 
// Возвращаемое значение:
// 	Возврат СтруктураОтображаемыхЗначений	 -	Структура         	 Структура общих настроек.
//
Функция ПолучитьОписаниеНастроек() Экспорт
	
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("СправочнаяИнформация",
														 "СправочнаяИнформация",,
														 СокрЛП(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор));
														 
	Возврат СтруктураНастроек;
	
КонецФункции // ПолучитьОписаниеНастроек()

// Процедура устанавливает описание настроек.
// 
// Параметры: 
// 	Настройка		   	 -	Строка                          Имя настройки.
// 	Объект			   	 -	Строка                          Имя объекта.
// 	СтруктураНастроек 	 -	Структура                       Структура сохраняемых настроек.
//
Процедура УстановитьОписаниеНастроек(СтруктураНастроек) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить("СправочнаяИнформация",
	             					 "СправочнаяИнформация", 
									 СтруктураНастроек,
						             ,
						             СокрЛП(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор));
									 
КонецПроцедуры // УстановитьОписаниеНастроек()

#КонецОбласти
